<template>
  <div>
    <div class="max-w-4xl mx-auto text-center mb-8">
      <h1 class="text-3xl md:text-5xl mb-2 font-semibold">Хватит переплачивать за одежду!</h1>
      <h3 class="text-xl md:text-3xl text-gray">Заказывайте брендовые одежды напрямую из Америки и Европы!</h3>
    </div>
    <div class="mb-[100px] md:mb-[200px]">
      <Promo/>
    </div>
    <div class="mb-8">
      <Slider/>
    </div>
    <div class="bg-light-blue py-10 md:py-14 mb-8">
      <Steps/>
    </div>
    <div v-show="axisY > 300"
         class="fixed bottom-8 right-4 md:right-8 p-2 rounded-[50%] shadow-box-dark cursor-pointer bg-white"
         @click="toScroll">
      <img src="/svg/arrow.svg" alt="arrow">
    </div>
  </div>
</template>
<script>
import Promo from "../components/common/Promo";
import Slider from "../components/common/Slider";
import Steps from "../components/common/Steps";

export default {
  name: 'IndexPage',
  components: {Steps, Slider, Promo},
  data() {
    return {
      axisY: 0
    }
  },
  head() {
    return {
      title: "Заказ одежды из Америки и Европы",
      meta: [
        {
          hid: 'description',
          name: 'description',
          content: 'Заказывайте брендовые одежды напрямую из Америки и Европы!'
        },
        {
          name: 'keywords',
          content:
            'заказать брендовые одежду, ' +
            'заказать брендовые одежду без переплаты, ' +
            'заказать брендовые одежду из америки, ' +
            'заказать брендовые одежду из сша, ' +
            'заказать брендовые одежду из европы, ' +
            'заказать брендовые одежду из турции, ' +
            'одежда из америки, ' +
            'одежда из америки с доставкой, ' +
            'одежда из сша, ' +
            'одежда из сша с доставкой, ' +
            'одежда из европы, ' +
            'одежда из европы с доставкой, ' +
            'одежда из турции, ' +
            'одежда из турции с доставкой, ' +
            'купить брендовые одежду, ' +
            'купить брендовые одежду из америки, ' +
            'купить брендовые одежду из сша, ' +
            'купить брендовые одежду из европы, ' +
            'купить брендовые одежду из турции, ' +
            'заказать одежду adidas, ' +
            'заказать одежду nike, ' +
            'заказать одежду lacoste, ' +
            'заказать одежду timberland, ' +
            'заказать одежду coach, ' +
            'доставка одежды, ' +
            'доставка одежды из америки, ' +
            'доставка одежды из сша, ' +
            'доставка одежды из европы, ' +
            'доставка одежды из турции, ' +
            'nike алматы, ' +
            'nike астана, ' +
            'найк алматы, ' +
            'найк астана, ' +
            'найк астана, ' +
            'найк аир форс, ' +
            'найк джорданс, ' +
            'найк кроссовки, ' +
            'найк футболка, ' +
            'найк казахстан, ' +
            'найк кроссовки мужские, ' +
            'найк кроссовки женские, ' +
            'adidas алматы, ' +
            'adidas астана, ' +
            'адидас алматы, ' +
            'адидас астана, ' +
            'адидас астана, ' +
            'адидас казахстан, ' +
            'адидас кроссовки, ' +
            'адидас футболка, ' +
            'адидас кроссовки мужские, ' +
            'адидас кроссовки женские, ' +
            'reebok алматы, ' +
            'reebok астана, ' +
            'рибок алматы, ' +
            'рибок астана, ' +
            'рибок кроссовки, ' +
            'рибок казахстан, ' +
            'timberland алматы, ' +
            'gap алматы, ' +
            'кроссовки алматы, ' +
            'кроссовки астана, ' +
            'кроссовки nike, ' +
            'кроссовки найк, ' +
            'кроссовки найк аир форс, ' +
            'кроссовки найк джордан, ' +
            'кроссовки найк алматы, ' +
            'кроссовки найк астана, ' +
            'кроссовки найк мужские, ' +
            'кроссовки найк мужские алматы, ' +
            'кроссовки найк мужские астана, ' +
            'кроссовки найк женские, ' +
            'кроссовки найк женские астана, ' +
            'кроссовки найк оригинал, ' +
            'кроссовки adidas, ' +
            'кроссовки адидас, ' +
            'кроссовки адидас алматы, ' +
            'кроссовки адидас астана, ' +
            'кроссовки адидас оригинал, ' +
            'майкл заказать, ' +
            'майкл корс алматы, ' +
            'майкл корс астана, ' +
            'майкл корс казахстан, ' +
            'майкл корс кроссовки, ' +
            'майкл корс кроссовки мужские, ' +
            'майкл корс кроссовки женские, ' +
            'майкл корс сумки, ' +
            'майкл корс рюкзак, ' +
            'тимберленд алматы, ' +
            'тимберленд астана, ' +
            'тимберленд казахстан, ' +
            'тимберленд обувь, ' +
            'тимберленд обувь алматы, ' +
            'тимберленд обувь астана, ' +
            'тимберленд обувь мужская, ' +
            'тимберленд обувь женская, ' +
            'тимберленд сша, ' +
            'лакоста алматы, ' +
            'лакоста астана, ' +
            'лакоста обувь, ' +
            'лакоста кроссовки, ' +
            'лакоста сумки, ' +
            'лакоста футболка, ' +
            'кельвин кляйн алматы, ' +
            'кельвин кляйн астана, ' +
            'кельвин кляйн казахстан, ' +
            'кельвин кляйн кз, ' +
            'кельвин кляйн сумки, ' +
            'кельвин кляйн футболка, ' +
            'кельвин кляйн белье, ' +
            'кельвин кляйн рюкзак, '
        },
        {
          name: 'google-site-verification',
          content: '8o7R9w8kVNUHGqFkQMiR4TKL3ESs9mBM180ZQ5KGDOY'
        },
        {
          name: 'yandex-verification',
          content: 'b94e8dccfc960b1f'
        },
        {
          property: 'og:url',
          content: 'https://buyer-consulting.kz/'
        },
        {
          property: 'og:site_name',
          content: 'Брендовые одежды из Америки и Европы.'
        },
        {
          property: 'og:description',
          content: 'Заказывайте брендовые одежды из Америки и Европы из официальных интернет-магазинов.'
        },
        {
          property: 'og:type',
          content: 'article'
        },
        {
          property: 'og:title',
          content: 'Брендовые одежды из Америки и Европы (Nike, Adidas, Lacoste, Coach...).'
        }
      ]
    }
  },
  mounted() {
    window.addEventListener("scroll", this.handleScroll)
  },
  beforeDestroy() {
    window.removeEventListener("scroll", this.handleScroll)
  },
  methods: {
    handleScroll() {
      this.axisY = window.scrollY
    },
    toScroll() {
      window.scrollTo({
        top: 0,
        left: 0,
        behavior: 'smooth'
      });
    }
  }
}
</script>
